Tekla Open API Reference for Tekla Structures 2025
BasePoint.ConvertToBasePoint Method (Point)
 Converts the given local point to this base point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point ConvertToBasePoint(
	Point point
)
Public Function ConvertToBasePoint (
	point As Point
) As Point
Parameters
point
Type: Tekla.Structures.Geometry3d.Point
The point to be converted.
Return Value
Type: Point
On success, the converted value. Otherwise the original value.
See Also
Reference
BasePoint Class
ConvertToBasePoint Overload
Tekla.Structures.Model Namespace